** Babel
   #+BEGIN_SRC elisp
     ;; org-babel-load-languages is a variable defined in `org.el'.
     ;; It is a list of languages which can be evaluated in Org-mode buffers.
     ;; Emacs Lisp (which has no requirements) is the only language loaded by default
     ;; with org mode. Here, we "load" Perl, then code blocks in Perl can be evaluated
     ;; with `org-babel-execute-src-block' bound to C-c C-c
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((perl . t) (ruby . t) (sh . t)
        ))
   #+END_SRC

   #+RESULTS:
   | (perl . t) | (ruby . t) | (sh . t) |

   #+BEGIN_SRC emacs-lisp
     (setq org-confirm-babel-evaluate nil)
   #+END_SRC  

   #+RESULTS:

